# 03. Cleaning the data

* missing data
* incorrect data
* incomplete data
* duplicates
* outliers
* abbreviations
* inconsistency in units
* typos
* bad formatting

In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('data/tmdb_5000_movies.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4803 entries, 0 to 4802
Data columns (total 20 columns):
budget                  4803 non-null int64
genres                  4803 non-null object
homepage                1712 non-null object
id                      4803 non-null int64
keywords                4803 non-null object
original_language       4803 non-null object
original_title          4803 non-null object
overview                4800 non-null object
popularity              4803 non-null float64
production_companies    4803 non-null object
production_countries    4803 non-null object
release_date            4802 non-null object
revenue                 4803 non-null int64
runtime                 4801 non-null float64
spoken_languages        4803 non-null object
status                  4803 non-null object
tagline                 3959 non-null object
title                   4803 non-null object
vote_average            4803 non-null float64
vote_count              4803 non-null int64
dtypes: float64(3), int64(4), object(13)
memory usage: 750.5+ KB

In [8]:
df.isnull().sum()

budget                     0
genres                     0
homepage                3091
id                         0
keywords                   0
original_language          0
original_title             0
overview                   3
popularity                 0
production_companies       0
production_countries       0
release_date               1
revenue                    0
runtime                    2
spoken_languages           0
status                     0
tagline                  844
title                      0
vote_average               0
vote_count                 0
dtype: int64

In [9]:
df2=df.dropna() ## delete all rows with empty line

In [10]:
df3 = df.dropna(how='all') ## all colums have NaN
df3.shape
#(4803, 20)

(4803, 20)

In [11]:
df.dropna(thresh=4000, axis=1, inplace=True)

## 03. Removing duplicate values

In [12]:
df =  pd.DataFrame({ 'color': ['blue','blue','red','red','blue'], 'value': [2,1,3,3,2]})

In [17]:
df

  color  value
0  blue      2
1  blue      1
2   red      3
3   red      3
4  blue      2

In [16]:
df.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [18]:
df.duplicated(keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [20]:
df.duplicated(keep=False)

0     True
1    False
2     True
3     True
4     True
dtype: bool

In [21]:
df.loc[df.duplicated(),:]

  color  value
3   red      3
4  blue      2

In [22]:
df.drop_duplicates()

  color  value
0  blue      2
1  blue      1
2   red      3